---
kind: method
id: M:Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Dispose
source: html/2a594db0-bce0-1bd2-8479-b39f9a50cdf6.htm
---
# Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Dispose Method

Releases all resources used by the AppearanceAssetEditScope

## Syntax (C#)
```csharp
public void Dispose()
```